In [58]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [59]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"], axis="columns", inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [60]:
target=df.Survived
inputs=df.drop("Survived",axis="columns")

In [61]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [62]:
inputs=pd.concat([inputs,dummies],axis="columns")
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [66]:
inputs.drop("Sex",axis="columns",inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [67]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [89]:
inputs.Age[:10]

0    22
1    38
2    26
3    35
4    35
5    29
6    54
7     2
8    27
9    14
Name: Age, dtype: int32

In [90]:
inputs['Age'] = inputs['Age'].fillna(inputs['Age'].mean()).astype(int)
inputs.head(6)

   Pclass  Age     Fare  female  male
0       3   22   7.2500       0     1
1       1   38  71.2833       1     0
2       3   26   7.9250       1     0
3       1   35  53.1000       1     0
4       3   35   8.0500       0     1
5       3   29   8.4583       0     1

In [91]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test=train_test_split(inputs,target,test_size=0.2)

In [92]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [93]:
model.fit(X_train,y_train)

GaussianNB()

In [94]:
model.score(X_test,y_test)

0.770949720670391

In [95]:
X_test[:10]

     Pclass  Age      Fare  female  male
130       3   33    7.8958       0     1
821       3   27    8.6625       0     1
582       2   54   26.0000       0     1
419       3   10   24.1500       1     0
575       3   19   14.5000       0     1
698       1   49  110.8833       0     1
116       3   70    7.7500       0     1
558       1   39   79.6500       1     0
473       2   23   13.7917       1     0
707       1   42   26.2875       0     1

In [96]:
y_test[:10]

130    0
821    1
582    0
419    0
575    0
698    0
116    0
558    1
473    1
707    1
Name: Survived, dtype: int64

In [97]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 0, 1, 0, 1, 1, 0], dtype=int64)

In [99]:
model.predict_proba(X_test[:10])

array([[0.99182206, 0.00817794],
       [0.99160241, 0.00839759],
       [0.97273459, 0.02726541],
       [0.04726486, 0.95273514],
       [0.99061416, 0.00938584],
       [0.23380527, 0.76619473],
       [0.97973057, 0.02026943],
       [0.00141867, 0.99858133],
       [0.02859827, 0.97140173],
       [0.91300695, 0.08699305]])